package ru.glindaqu.ejournal.viewModel.implementation

import android.app.Application
import androidx.lifecycle.AndroidViewModel
import ru.glindaqu.ejournal.viewModel.api.IJournalViewModel

class JournalViewModel(app: Application) : AndroidViewModel(app), IJournalViewModel {

    override val studentsList = listOf(
        "гекыонкыоынко",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
        "Воробьева Дарья Алексеевна",
    )

}